benchmark/aggregate serverfull.csv
Label,# Samples,Average,Median,90% Line,95% Line,99% Line,Min,Max,Error %,Throughput,Received KB/sec,Sent KB/sec
Quick API 5,5,9,7,8,21,21,6,21,0.000%,.20827,0.03,0.03
Compute API 5,5,5308,5277,5345,5440,5440,5228,5440,0.000%,.17079,0.03,0.02
Read API 5,5,28,12,54,55,55,9,55,0.000%,.20781,0.03,0.03
Write API 5,5,566,582,587,595,595,528,595,0.000%,.20334,0.03,0.03
Quick API 25,25,2268,8,5848,8305,13565,6,13565,0.000%,.64491,0.10,0.08
Compute API 25,25,6424,5327,8645,10146,14754,5230,14754,0.000%,.56741,0.09,0.08
Read API 25,25,2340,638,5212,7251,13108,9,13108,0.000%,.64405,0.08,0.08
Write API 25,25,2748,732,6538,8261,8481,515,8481,0.000%,.61531,0.09,0.08
Quick API 50,50,3461,66,8233,14304,24432,6,24432,0.000%,.98352,0.15,0.13
Compute API 50,50,9225,6022,17803,22547,26822,5193,26822,0.000%,.89038,0.13,0.12
Read API 50,50,4700,1510,16176,17315,19617,9,19617,0.000%,.96613,0.13,0.12
Write API 50,50,3894,1060,8867,15067,23183,684,23183,0.000%,.95073,0.14,0.12
Quick API 100,100,8025,5228,20992,25719,30077,6,30673,0.000%,1.76115,0.27,0.23
Compute API 100,100,17258,12306,32699,43101,60689,5248,64253,0.000%,.94480,0.14,0.13
Read API 100,100,10400,5973,25808,32987,54733,8,59385,0.000%,.99389,0.13,0.13
Write API 100,100,10368,4011,30653,35160,50109,533,51832,0.000%,.95868,0.14,0.12
Quick API 5 Direct,5,9,5,5,29,29,5,29,0.000%,.20829,0.04,0.03
Compute API 5 Direct,5,5360,5356,5357,5403,5403,5340,5403,0.000%,.17032,0.03,0.02
Read API 5 Direct,5,9,9,11,12,12,8,12,0.000%,.20809,0.03,0.03
Write API 5 Direct,5,605,606,608,620,620,594,620,0.000%,.20293,0.03,0.03
Quick API 25 Direct,25,16192,9298,20050,97213,98410,4,98410,0.000%,.19839,0.03,0.03
Compute API 25 Direct,25,40358,32867,82155,92846,98160,5360,98160,0.000%,.18275,0.03,0.03
Read API 25 Direct,25,36168,27909,77201,87974,93328,19,93328,0.000%,.17663,0.03,0.02
Write API 25 Direct,25,22072,16695,22105,71420,98672,619,98672,0.000%,.17512,0.03,0.02
Quick API 50 Direct,50,26216,28476,40397,41590,42852,6,42852,0.000%,1.02153,0.18,0.13
Compute API 50 Direct,50,97087,86285,194608,205786,221877,5362,221877,0.000%,.18463,0.03,0.03
Read API 50 Direct,50,93915,83909,192037,202648,218687,34,218687,0.000%,.18661,0.03,0.02
Write API 50 Direct,50,38804,14817,146329,222410,224017,870,224017,0.000%,.17072,0.03,0.02
Quick API 100 Direct,100,68967,81604,93462,94945,96133,7,96428,0.000%,.97642,0.17,0.12
Compute API 100 Direct,100,188029,166955,381769,409015,430412,5395,435733,0.000%,.18582,0.03,0.03
Read API 100 Direct,100,189115,169685,384572,411313,432712,63,438086,0.000%,.18479,0.03,0.02
Write API 100 Direct,100,96307,36513,437813,440569,442845,1197,443414,0.000%,.16589,0.03,0.02
TOTAL,1440,52768,13402,166955,285610,436241,4,443414,0.000%,1.08442,0.17,0.14