benchmark/aggregate total.csv
Label,# Samples,Average,Median,90% Line,95% Line,99% Line,Min,Max,Error %,Throughput,Received KB/sec,Sent KB/sec
Quick API 5 Direct,5,8,5,6,20,20,5,20,0.000%,.20829,0.04,0.03
Compute API 5 Direct,5,5165,5161,5182,5185,5185,5146,5185,0.000%,.17143,0.03,0.02
Read API 5 Direct,5,18,9,9,55,55,9,55,0.000%,.20842,0.03,0.03
Write API 5 Direct,5,532,528,542,550,550,517,550,0.000%,.20448,0.03,0.03
Quick API 25 Direct,25,18262,9553,20307,88421,89618,7,89618,0.000%,.21547,0.04,0.03
Compute API 25 Direct,25,35644,26442,73718,83982,89115,5144,89115,0.000%,.18999,0.03,0.03
Read API 25 Direct,25,31992,21694,68964,79370,84497,19,84497,0.000%,.18387,0.03,0.02
Write API 25 Direct,25,23727,20870,24943,68580,89628,613,89628,0.000%,.18144,0.03,0.02
Quick API 50 Direct,50,24648,26594,38519,39713,41504,5,41504,0.000%,1.06254,0.18,0.14
Compute API 50 Direct,50,93456,83109,187687,197983,213435,5138,213435,0.000%,.19195,0.03,0.03
Read API 50 Direct,50,90299,80636,184698,194962,210373,32,210373,0.000%,.19396,0.03,0.02
Write API 50 Direct,50,37604,15183,135689,213950,215534,841,215534,0.000%,.17662,0.03,0.02
Quick API 100 Direct,100,62693,73113,84982,86467,87656,5,87953,0.000%,1.06814,0.19,0.14
Compute API 100 Direct,100,183784,165284,372160,397853,418365,5177,423502,0.000%,.19338,0.03,0.03
Read API 100 Direct,100,184747,167817,374135,399764,420248,58,425364,0.000%,.19245,0.03,0.02
Write API 100 Direct,100,88675,33482,425049,427710,429942,1164,430507,0.000%,.17221,0.03,0.02
Quick API 5,5,10,7,7,23,23,6,23,0.000%,.20828,0.03,0.03
Compute API 5,5,5187,5164,5174,5291,5291,5151,5291,0.000%,.17149,0.03,0.02
Read API 5,5,50,55,56,71,71,14,71,0.000%,.20904,0.03,0.03
Write API 5,5,549,547,558,569,569,533,569,0.000%,.20501,0.03,0.03
Quick API 25,25,1552,8,4054,6904,8434,6,8434,0.000%,.70144,0.11,0.09
Compute API 25,25,6361,5359,8095,10870,14888,5180,14888,0.000%,.60502,0.09,0.08
Read API 25,25,875,13,2644,3081,6545,9,6545,0.000%,.69365,0.09,0.09
Write API 25,25,2526,850,5871,6380,11196,499,11196,0.000%,.68079,0.10,0.09
Quick API 50,50,3855,2392,10864,11436,14193,6,14193,0.000%,1.24267,0.19,0.16
Compute API 50,50,10674,8563,20716,21742,26231,5177,26231,0.000%,.81392,0.12,0.11
Read API 50,50,4328,1442,11724,13870,24659,9,24659,0.000%,.86176,0.11,0.11
Write API 50,50,5986,2241,17183,19287,24879,526,24879,0.000%,.85422,0.12,0.11
Quick API 100,100,9000,6256,19974,22522,25872,6,33241,0.000%,1.59637,0.25,0.20
Compute API 100,100,14732,13438,26179,30267,36436,5233,37150,0.000%,1.31401,0.20,0.18
Read API 100,100,11171,9728,23789,27313,30813,9,34303,0.000%,1.29629,0.17,0.16
Write API 100,100,9845,8949,21134,22224,33259,686,35357,0.000%,1.28601,0.18,0.16
TOTAL,1440,50756,15183,161461,275991,423502,5,430507,0.000%,.82677,0.13,0.11